Revit.Elements.AdaptiveComponent.#ctor(System.Double[][],Revit.GeometryReferences.ElementFaceReference,Revit.Elements.FamilyType)
Internal constructor for the AdaptiveComponent wrapper
pts: Points to use as reference
f: Face to use as reference
ft: familyType to place

Revit.Elements.AdaptiveComponent.#ctor(System.Double[],Autodesk.Revit.DB.Reference,Revit.Elements.FamilyType)
Internal constructor for the AdaptiveComponent wrapper
parms: Params on curve to reference
c: Curve to use as reference
ft: familyType to place

Revit.Elements.AdaptiveComponent.InitAdaptiveComponent(System.Double[][],Revit.GeometryReferences.ElementFaceReference,Revit.Elements.FamilyType)
Initialize an AdaptiveComponent element
uvParams: Parameters to use as reference
f: Face to use as reference
ft: familyType to place

Revit.Elements.AdaptiveComponent.InitAdaptiveComponent(System.Double[],Autodesk.Revit.DB.Reference,Revit.Elements.FamilyType)
Initialize an AdaptiveComponent element
parms: Params on curve to reference
c: Curve to use as reference
ft: familyType to place

Revit.Elements.AdaptiveComponent.UpdatePlacementPoints(Autodesk.Revit.DB.FamilyInstance,Autodesk.Revit.DB.XYZ[])
Update the placement points of the adaptive component instance to the given points
fi:
pnt:

Revit.Elements.AdaptiveComponent.InternalSetFamilySymbol(Revit.Elements.FamilyType)
Set the family symbol for the internal family instance
ft:

Revit.Elements.AdaptiveComponent.Type
symbol

Revit.Elements.AdaptiveComponent.ByPoints(Autodesk.DesignScript.Geometry.Point[][],Revit.Elements.FamilyType)
Create a list of adaptive components from two-dimensional array of points
points: a two-dimensional array of points
familyType: a family type to use to create the adaptive components
Returns:

Revit.Elements.AdaptiveComponent.ByParametersOnFace(Autodesk.DesignScript.Geometry.UV[],Autodesk.DesignScript.Geometry.Surface,Revit.Elements.FamilyType)
Create an adaptive component by uv points on a face.
uvs: An array of UV pairs
surface: The surface on which to place the AdaptiveComponent
familyType:
Returns:

Revit.Elements.AdaptiveComponent.ByParametersOnCurveReference(System.Double[],Autodesk.DesignScript.Geometry.Curve,Revit.Elements.FamilyType)
Create an adaptive component referencing the parameters on a Curve reference
parameters: The parameters on the curve
curve: The curve to reference
familyType: The family type to construct
Returns:

Revit.Elements.AdaptiveComponent.InternalByPoints(Autodesk.DesignScript.Geometry.Point[][],Revit.Elements.FamilyType)
Create a list of adaptive components from two-dimensional array of points
points: a two-dimensional array of points
familyType: a family type to use to create the adaptive components
Returns: